Перем ТестПеременная;
Перем ТестПеременнаяЭкспорт Экспорт;

//Стандартный простой комментарий. 
//
Процедура ТестЭкспортФункция(Знач Параметры) Экспорт 
	
КонецПроцедуры

// Опсание процедуры с параметрами.
// проверка описания подсказки к параметрам и проверка формирования документации по стандартным 
// параметрам к процедуре 
//	Параметры:
//		ЗнакТабуляции - СправочниСсылка.Номенклатура - станартное описание, через два знака tab для описания параметра. 
//		НоваяФичаТипаСруктуры - Структура - описание структуры опять таки ниже через + описываем ключи и их знаения. 
//			+ КлючСтруктуры - Строка - описание типа 
//			+ КлючБезТипа - тип не указываем, поэтому не знаем то считать это типом, то ли считать описанием. 
//
//	Возвращаемое значение:
//		Булево - Истина/Ложь - описание считаем после двух --, тогда только можно сказать что это описание. 
//
&НаКлиенте
Функция СложнаяФункцияСКучейПараметров(Знач ЗнакТабуляции, НоваяФичаТипаСруктуры) Экспорт
	Перем КакаяТоПеременная;
	
	Проверка(ТестЭкспортФункция1(ЗнакТабуляции)); //Проверка как определит что это локальный вызов. 
	module.ТестЭкспортФункция(ЗнакТабуляции); //Определяем что это вызом экспортной процедуры из файла модуля. 
	
	Возврат Истина;
КонецФункции

// Текст описания модуля с непонятными строками. 

// ТестСКомментарием
//
Функция ТестСКомментарием() 
	
КонецФункции

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает аккуратно построеное наименование через запятую по парам "Название" + "Сокращение"
//
Функция ПолноеНаименование(Знач н0 = "", Знач с0 = "", Знач н1 = "", Знач с1 = "", Знач н2 = "", Знач с2 = "", Знач н3 = "", Знач с3 = "", Знач н4 = "", Знач с4 = "", Знач н5 = "", Знач с5 = "", Знач н6 = "", Знач с6 = "", Знач н7 = "", Знач с7 = "", Знач н8 = "", Знач с8 = "", Знач н9 = "", Знач с9 = "") 
	
	// Часть 0

КонецФункции

СложнаяФункцияСКучейПараметров();