//Стандартный простой комментарий. 
//
Процедура ТестЭкспортФункция(Знач Параметры) Экспорт 
	
КонецПроцедуры

// Опсание процедуры с параметрами.
// проверка описания подсказки к параметрам и проверка формирования документации по стандартным 
// параметрам к процедуре 
//	Параметры:
//		ЗнакТабуляции - СправочниСсылка.Номенклатура - станартное описание, через два знака tab для описания параметра. 
//		НоваяФичаТипаСруктуры - Структура - описание структуры опять таки ниже через + описываем ключи и их знаения. 
//			+ КлючСтруктуры - Строка - описание типа 
//			+ КлючБезТипа - тип не указываем, поэтому не знаем то считать это типом, то ли считать описанием. 
//
//	Возвращаемое значение:
//		Булево - Истина/Ложь - описание считаем после двух --, тогда только можно сказать что это описание. 
//
&НаКлиенте
Функция СложнаяФункцияСКучейПараметров(Знач ЗнакТабуляции, НоваяФичаТипаСруктуры) Экспорт
	Перем КакаяТоПеременная;
	
	ТестЭкспортФункция(ЗнакТабуляции); //Проверка как определит что это локальный вызов. 
	module.ТестЭкспортФункция(ЗнакТабуляции); //Определяем что это вызом экспортной процедуры из файла модуля. 
	
	Возврат Истина;
КонецФункции